Repository: koniz-dev/grex
Catalog: lib/l10n/app_*.arb
Languages: vi

# welcome
source: Welcome to Grex with Clean Architecture!
vi: Chào mừng đến với Grex với Clean Architecture!

# featureFlagsReady
source: Feature Flags System is ready!
vi: Hệ thống Feature Flags đã sẵn sàng!

# checkExamples
source: Check the examples in feature_flags_example_screen.dart
vi: Xem các ví dụ trong feature_flags_example_screen.dart

source: Login
vi: Đăng nhập

source: Register
vi: Đăng ký

source: Password
vi: Mật khẩu

source: Name
vi: Tên

# emailRequired
source: Please enter your email
vi: Vui lòng nhập email của bạn

# emailInvalid
source: Please enter a valid email address
vi: Vui lòng nhập địa chỉ email hợp lệ

# passwordRequired
source: Please enter your password
vi: Vui lòng nhập mật khẩu

# passwordMinLength
source: Password must be at least {minLength} characters
vi: Mật khẩu phải có ít nhất {minLength} ký tự

# nameRequired
source: Please enter your name
vi: Vui lòng nhập tên của bạn

# nameMinLength
source: Name must be at least {minLength} characters
vi: Tên phải có ít nhất {minLength} ký tự

# dontHaveAccount
source: Don't have an account? Register
vi: Chưa có tài khoản? Đăng ký

# alreadyHaveAccount
source: Already have an account? Login
vi: Đã có tài khoản? Đăng nhập

source: Retry
vi: Thử lại

source: Error
vi: Lỗi

source: Loading...
vi: Đang tải...

source: Language
vi: Ngôn ngữ

source: Select Language
vi: Chọn ngôn ngữ

source: English
vi: Tiếng Anh

source: Spanish
vi: Tiếng Tây Ban Nha

source: Arabic
vi: Tiếng Ả Rập

source: Vietnamese
vi: Tiếng Việt

source: Feature Flags Debug
vi: Gỡ lỗi Feature Flags

# unexpectedError
source: An unexpected error occurred
vi: Đã xảy ra lỗi không mong muốn

# badRequest
source: Bad request. Please check your input.
vi: Yêu cầu không hợp lệ. Vui lòng kiểm tra thông tin nhập vào.

# unauthorized
source: Unauthorized. Please login again.
vi: Không được phép. Vui lòng đăng nhập lại.

# forbidden
source: Forbidden. You do not have permission.
vi: Bị cấm. Bạn không có quyền truy cập.

# notFound
source: Resource not found.
vi: Không tìm thấy tài nguyên.

# conflict
source: Conflict. The resource already exists.
vi: Xung đột. Tài nguyên đã tồn tại.

# validationError
source: Validation error. Please check your input.
vi: Lỗi xác thực. Vui lòng kiểm tra thông tin nhập vào.

# tooManyRequests
source: Too many requests. Please try again later.
vi: Quá nhiều yêu cầu. Vui lòng thử lại sau.

# internalServerError
source: Internal server error. Please try again later.
vi: Lỗi máy chủ nội bộ. Vui lòng thử lại sau.

# badGateway
source: Bad gateway. Please try again later.
vi: Cổng kết nối không hợp lệ. Vui lòng thử lại sau.

# serviceUnavailable
source: Service unavailable. Please try again later.
vi: Dịch vụ không khả dụng. Vui lòng thử lại sau.

# gatewayTimeout
source: Gateway timeout. Please try again later.
vi: Hết thời gian chờ cổng kết nối. Vui lòng thử lại sau.

# clientError
source: Client error occurred.
vi: Đã xảy ra lỗi phía máy khách.

# serverError
source: Server error occurred. Please try again later.
vi: Đã xảy ra lỗi máy chủ. Vui lòng thử lại sau.

# itemCount
source: {count, plural, =0{No items} =1{1 item} other{{count} items}}
vi: {count, plural, =0{Không có mục nào} =1{1 mục} other{{count} mục}}

# minutesAgo
source: {count, plural, =0{Just now} =1{1 minute ago} other{{count} minutes ago}}
vi: {count, plural, =0{Vừa xong} =1{1 phút trước} other{{count} phút trước}}

source: Edit
vi: Chỉnh sửa

source: Delete
vi: Xóa

source: Save
vi: Lưu

source: Cancel
vi: Hủy

source: Add
vi: Thêm

source: Refresh
vi: Làm mới

source: No items found
vi: Không tìm thấy mục nào

source: Load More
vi: Tải thêm

source: Copy Error
vi: Sao chép lỗi

source: Restart
vi: Khởi động lại

# errorOccurred
source: An unexpected error occurred
vi: Đã xảy ra lỗi không mong muốn

# errorDescription
source: The application encountered an error that could not be handled. We have logged this error and will fix it in the next version.
vi: Ứng dụng gặp phải lỗi không thể xử lý. Chúng tôi đã ghi nhận lỗi này và sẽ khắc phục trong phiên bản tiếp theo.

source: Error Details:
vi: Chi tiết lỗi:

# copyErrorSuccess
source: Error details copied
vi: Đã sao chép chi tiết lỗi

# contactSupport
source: If the error persists, please contact technical support.
vi: Nếu lỗi vẫn tiếp tục, vui lòng liên hệ bộ phận hỗ trợ kỹ thuật.

source: Close
vi: Đóng

source: Page Not Found
vi: Không tìm thấy trang

source: Go to Groups
vi: Đi đến Nhóm

source: Add Payment
vi: Thêm thanh toán

source: Create Payment
vi: Tạo thanh toán

# paymentCreatedSuccess
source: Payment created successfully
vi: Tạo thanh toán thành công

# selectPayer
source: Please select who made the payment
vi: Vui lòng chọn người thanh toán

# selectRecipient
source: Please select who received the payment
vi: Vui lòng chọn người nhận thanh toán

# payerRecipientSame
source: Payer and recipient cannot be the same person
vi: Người thanh toán và người nhận không thể là cùng một người

source: Payment Details
vi: Chi tiết thanh toán

source: Delete Payment
vi: Xóa thanh toán

# confirmDeletePayment
source: Are you sure you want to delete this payment?
vi: Bạn có chắc chắn muốn xóa thanh toán này không?

source: Add First Payment
vi: Thêm thanh toán đầu tiên

source: Clear All
vi: Xóa tất cả

source: Ascending Order
vi: Thứ tự tăng dần

source: Apply
vi: Áp dụng

# minAmountNegative
source: Minimum amount cannot be negative
vi: Số tiền tối thiểu không thể âm

# maxAmountNegative
source: Maximum amount cannot be negative
vi: Số tiền tối đa không thể âm

# minGreaterThanMax
source: Min amount cannot be greater than max amount
vi: Số tiền tối thiểu không thể lớn hơn số tiền tối đa

# startAfterEnd
source: Start date cannot be after end date
vi: Ngày bắt đầu không thể sau ngày kết thúc

source: Create New Group
vi: Tạo nhóm mới

# featureFlagsDebugTitle
source: Feature Flags Debug
vi: Gỡ lỗi Feature Flags

source: Clear All Overrides
vi: Xóa tất cả ghi đè

# confirmClearOverrides
source: Are you sure you want to clear all local overrides?
vi: Bạn có chắc chắn muốn xóa tất cả ghi đè cục bộ không?

source: Clear
vi: Xóa

# overridesCleared
source: All local overrides cleared
vi: Đã xóa tất cả ghi đè cục bộ

# noFeatureFlags
source: No feature flags found
vi: Không tìm thấy feature flags

source: Feature Flags Examples
vi: Ví dụ Feature Flags

# newFeatureEnabled
source: New Feature is ENABLED
vi: Tính năng mới đã BẬT

# newFeatureDisabled
source: New Feature is DISABLED
vi: Tính năng mới đã TẮT

source: No Payments
vi: Không có thanh toán

source: Payment Summary
vi: Tóm tắt thanh toán

source: Total Payments
vi: Tổng số thanh toán

source: Total Amount
vi: Tổng số tiền

source: Error loading payments
vi: Lỗi khi tải thanh toán

source: Filter payments
vi: Lọc thanh toán

source: Clear filters
vi: Xóa bộ lọc

# filterAndSortPayments
source: Filter & Sort Payments
vi: Lọc & Sắp xếp thanh toán

source: Date Range
vi: Khoảng ngày

source: Amount Range
vi: Khoảng số tiền

source: Sort By
vi: Sắp xếp theo

source: Start Date
vi: Ngày bắt đầu

source: End Date
vi: Ngày kết thúc

source: Min Amount
vi: Số tiền tối thiểu

source: Max Amount
vi: Số tiền tối đa

source: Select date
vi: Chọn ngày

source: Oldest to newest
vi: Cũ nhất đến mới nhất

source: Newest to oldest
vi: Mới nhất đến cũ nhất

# amountRequired
source: Amount is required
vi: Số tiền là bắt buộc

# enterValidPositiveAmount
source: Enter a valid positive amount
vi: Nhập số tiền dương hợp lệ

source: Currency
vi: Tiền tệ

source: Description (Optional)
vi: Mô tả (Tùy chọn)

# whatWasPaymentFor
source: What was this payment for?
vi: Thanh toán này dùng cho việc gì?

source: Payment Date
vi: Ngày thanh toán

source: Payment Participants
vi: Người tham gia thanh toán

source: Who paid? *
vi: Ai đã thanh toán? *

# whoReceivedPayment
source: Who received the payment? *
vi: Ai nhận thanh toán? *

# cannotPaySelf
source: A person cannot pay themselves. Please select different payer and recipient.
vi: Một người không thể tự thanh toán cho chính mình. Vui lòng chọn người thanh toán và người nhận khác nhau.

# from
source: From: {name}
vi: Từ: {name}

# to
source: To: {name}
vi: Đến: {name}

# amount
source: Amount: {value}
vi: Số tiền: {value}

# description
source: Description: {text}
vi: Mô tả: {text}

# date
source: Date: {value}
vi: Ngày: {value}

# groupPayments
source: {groupName} Payments
vi: Thanh toán {groupName}

# enterPaymentAmount
source: Enter the payment amount
vi: Nhập số tiền thanh toán

# confirmDeletePaymentFrom
source: Are you sure you want to delete this payment from {payer} to {recipient}?
vi: Bạn có chắc chắn muốn xóa thanh toán này từ {payer} đến {recipient}?

# noPaymentsMatchCriteria
source: No payments match your criteria.
vi: Không có thanh toán nào phù hợp với tiêu chí của bạn.

# noPaymentsMatchSearch
source: No payments match your search criteria. Try adjusting your filters.
vi: Không có thanh toán nào phù hợp với tiêu chí tìm kiếm. Hãy thử điều chỉnh bộ lọc.

# noPaymentsYet
source: No payments yet. Add your first payment to get started!
vi: Chưa có thanh toán nào. Thêm thanh toán đầu tiên để bắt đầu!

# amountLabel
source: Amount *
vi: Số tiền *

source: Example Screen
vi: Màn hình ví dụ

source: Example Screen Content
vi: Nội dung màn hình ví dụ
